; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f48-c19-s4-i19-g4-r2053-024-124-224-324
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12 h13 h14 h15 h16 h17 h18 h19 h20 h21 h22 h23 h24
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12 s13 s14 s15 s16 s17 s18 s19 s20 s21 s22 s23 s24
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 d14 d15 d16 d17 d18 d19 d20 d21 d22 d23 d24
 - card
          celln0 celln1 celln2 celln3 celln4 celln5 celln6 celln7 celln8 celln9 celln10 celln11 celln12 celln13 celln14 celln15 celln16 celln17 celln18 celln19 celln20 celln21 celln22 celln23 celln24 celln25 celln26 celln27 celln28 celln29 celln30 celln31 celln32 celln33 celln34 celln35 celln36 celln37 celln38 celln39 celln40 celln41 celln42 celln43 celln44 celln45 celln46 celln47 celln48 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 coln10 coln11 coln12 coln13 coln14 coln15 coln16 coln17 coln18 coln19 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 n19 n20 n21 n22 n23 n24 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value c13 n13)
(value c14 n14)
(value c15 n15)
(value c16 n16)
(value c17 n17)
(value c18 n18)
(value c19 n19)
(value c20 n20)
(value c21 n21)
(value c22 n22)
(value c23 n23)
(value c24 n24)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value h13 n13)
(value h14 n14)
(value h15 n15)
(value h16 n16)
(value h17 n17)
(value h18 n18)
(value h19 n19)
(value h20 n20)
(value h21 n21)
(value h22 n22)
(value h23 n23)
(value h24 n24)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value s13 n13)
(value s14 n14)
(value s15 n15)
(value s16 n16)
(value s17 n17)
(value s18 n18)
(value s19 n19)
(value s20 n20)
(value s21 n21)
(value s22 n22)
(value s23 n23)
(value s24 n24)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(value d13 n13)
(value d14 n14)
(value d15 n15)
(value d16 n16)
(value d17 n17)
(value d18 n18)
(value d19 n19)
(value d20 n20)
(value d21 n21)
(value d22 n22)
(value d23 n23)
(value d24 n24)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(cellsuccessor celln5 celln4)
(cellsuccessor celln6 celln5)
(cellsuccessor celln7 celln6)
(cellsuccessor celln8 celln7)
(cellsuccessor celln9 celln8)
(cellsuccessor celln10 celln9)
(cellsuccessor celln11 celln10)
(cellsuccessor celln12 celln11)
(cellsuccessor celln13 celln12)
(cellsuccessor celln14 celln13)
(cellsuccessor celln15 celln14)
(cellsuccessor celln16 celln15)
(cellsuccessor celln17 celln16)
(cellsuccessor celln18 celln17)
(cellsuccessor celln19 celln18)
(cellsuccessor celln20 celln19)
(cellsuccessor celln21 celln20)
(cellsuccessor celln22 celln21)
(cellsuccessor celln23 celln22)
(cellsuccessor celln24 celln23)
(cellsuccessor celln25 celln24)
(cellsuccessor celln26 celln25)
(cellsuccessor celln27 celln26)
(cellsuccessor celln28 celln27)
(cellsuccessor celln29 celln28)
(cellsuccessor celln30 celln29)
(cellsuccessor celln31 celln30)
(cellsuccessor celln32 celln31)
(cellsuccessor celln33 celln32)
(cellsuccessor celln34 celln33)
(cellsuccessor celln35 celln34)
(cellsuccessor celln36 celln35)
(cellsuccessor celln37 celln36)
(cellsuccessor celln38 celln37)
(cellsuccessor celln39 celln38)
(cellsuccessor celln40 celln39)
(cellsuccessor celln41 celln40)
(cellsuccessor celln42 celln41)
(cellsuccessor celln43 celln42)
(cellsuccessor celln44 celln43)
(cellsuccessor celln45 celln44)
(cellsuccessor celln46 celln45)
(cellsuccessor celln47 celln46)
(cellsuccessor celln48 celln47)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(colsuccessor coln10 coln9)
(colsuccessor coln11 coln10)
(colsuccessor coln12 coln11)
(colsuccessor coln13 coln12)
(colsuccessor coln14 coln13)
(colsuccessor coln15 coln14)
(colsuccessor coln16 coln15)
(colsuccessor coln17 coln16)
(colsuccessor coln18 coln17)
(colsuccessor coln19 coln18)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(successor n13 n12)
(successor n14 n13)
(successor n15 n14)
(successor n16 n15)
(successor n17 n16)
(successor n18 n17)
(successor n19 n18)
(successor n20 n19)
(successor n21 n20)
(successor n22 n21)
(successor n23 n22)
(successor n24 n23)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit c13 c)
(hassuit c14 c)
(hassuit c15 c)
(hassuit c16 c)
(hassuit c17 c)
(hassuit c18 c)
(hassuit c19 c)
(hassuit c20 c)
(hassuit c21 c)
(hassuit c22 c)
(hassuit c23 c)
(hassuit c24 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit h13 h)
(hassuit h14 h)
(hassuit h15 h)
(hassuit h16 h)
(hassuit h17 h)
(hassuit h18 h)
(hassuit h19 h)
(hassuit h20 h)
(hassuit h21 h)
(hassuit h22 h)
(hassuit h23 h)
(hassuit h24 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit s13 s)
(hassuit s14 s)
(hassuit s15 s)
(hassuit s16 s)
(hassuit s17 s)
(hassuit s18 s)
(hassuit s19 s)
(hassuit s20 s)
(hassuit s21 s)
(hassuit s22 s)
(hassuit s23 s)
(hassuit s24 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(hassuit d13 d)
(hassuit d14 d)
(hassuit d15 d)
(hassuit d16 d)
(hassuit d17 d)
(hassuit d18 d)
(hassuit d19 d)
(hassuit d20 d)
(hassuit d21 d)
(hassuit d22 d)
(hassuit d23 d)
(hassuit d24 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack c12 h13)
(canstack c12 d13)
(canstack c13 h14)
(canstack c13 d14)
(canstack c14 h15)
(canstack c14 d15)
(canstack c15 h16)
(canstack c15 d16)
(canstack c16 h17)
(canstack c16 d17)
(canstack c17 h18)
(canstack c17 d18)
(canstack c18 h19)
(canstack c18 d19)
(canstack c19 h20)
(canstack c19 d20)
(canstack c20 h21)
(canstack c20 d21)
(canstack c21 h22)
(canstack c21 d22)
(canstack c22 h23)
(canstack c22 d23)
(canstack c23 h24)
(canstack c23 d24)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack h12 c13)
(canstack h12 s13)
(canstack h13 c14)
(canstack h13 s14)
(canstack h14 c15)
(canstack h14 s15)
(canstack h15 c16)
(canstack h15 s16)
(canstack h16 c17)
(canstack h16 s17)
(canstack h17 c18)
(canstack h17 s18)
(canstack h18 c19)
(canstack h18 s19)
(canstack h19 c20)
(canstack h19 s20)
(canstack h20 c21)
(canstack h20 s21)
(canstack h21 c22)
(canstack h21 s22)
(canstack h22 c23)
(canstack h22 s23)
(canstack h23 c24)
(canstack h23 s24)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack s12 h13)
(canstack s12 d13)
(canstack s13 h14)
(canstack s13 d14)
(canstack s14 h15)
(canstack s14 d15)
(canstack s15 h16)
(canstack s15 d16)
(canstack s16 h17)
(canstack s16 d17)
(canstack s17 h18)
(canstack s17 d18)
(canstack s18 h19)
(canstack s18 d19)
(canstack s19 h20)
(canstack s19 d20)
(canstack s20 h21)
(canstack s20 d21)
(canstack s21 h22)
(canstack s21 d22)
(canstack s22 h23)
(canstack s22 d23)
(canstack s23 h24)
(canstack s23 d24)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(canstack d12 c13)
(canstack d12 s13)
(canstack d13 c14)
(canstack d13 s14)
(canstack d14 c15)
(canstack d14 s15)
(canstack d15 c16)
(canstack d15 s16)
(canstack d16 c17)
(canstack d16 s17)
(canstack d17 c18)
(canstack d17 s18)
(canstack d18 c19)
(canstack d18 s19)
(canstack d19 c20)
(canstack d19 s20)
(canstack d20 c21)
(canstack d20 s21)
(canstack d21 c22)
(canstack d21 s22)
(canstack d22 c23)
(canstack d22 s23)
(canstack d23 c24)
(canstack d23 s24)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln48)
(colspace coln0)

(bottomcol c1)
(on c3 c1)
(on h15 c3)
(on d24 h15)
(clear d24)

(bottomcol c19)
(on s11 c19)
(on c20 s11)
(on h3 c20)
(clear h3)

(bottomcol s10)
(on s14 s10)
(on c11 s14)
(on c24 c11)
(on s5 c24)
(on d5 s5)
(clear d5)

(bottomcol d6)
(on d4 d6)
(on c21 d4)
(on c14 c21)
(on c13 c14)
(on d11 c13)
(on h12 d11)
(on d9 h12)
(clear d9)

(bottomcol h7)
(on s7 h7)
(on s13 s7)
(on h21 s13)
(clear h21)

(bottomcol c23)
(on c8 c23)
(clear c8)

(bottomcol d18)
(on s3 d18)
(on h8 s3)
(on d20 h8)
(clear d20)

(bottomcol h18)
(on h13 h18)
(on d3 h13)
(on h9 d3)
(on c6 h9)
(on d16 c6)
(on d23 d16)
(on h11 d23)
(clear h11)

(bottomcol h24)
(on s4 h24)
(on s12 s4)
(on s6 s12)
(on d12 s6)
(clear d12)

(bottomcol c22)
(on s8 c22)
(on h5 s8)
(on c18 h5)
(on s16 c18)
(on c9 s16)
(clear c9)

(bottomcol s1)
(on h1 s1)
(on h19 h1)
(clear h19)

(bottomcol s22)
(on c16 s22)
(on c4 c16)
(on h22 c4)
(on h4 h22)
(clear h4)

(bottomcol s23)
(on h10 s23)
(on c7 h10)
(on h16 c7)
(on h23 h16)
(on h14 h23)
(clear h14)

(bottomcol c17)
(on s24 c17)
(on s17 s24)
(on d19 s17)
(clear d19)

(bottomcol c12)
(on d7 c12)
(clear d7)

(bottomcol c5)
(on c15 c5)
(on d21 c15)
(on d2 d21)
(on s18 d2)
(clear s18)

(bottomcol c10)
(on h17 c10)
(on d8 h17)
(on d1 d8)
(on s20 d1)
(on s2 s20)
(on d10 s2)
(clear d10)

(bottomcol s21)
(on d14 s21)
(on h2 d14)
(on c2 h2)
(clear c2)

(bottomcol s15)
(on h6 s15)
(on h20 h6)
(on d22 h20)
(on d13 d22)
(on s19 d13)
(on d17 s19)
(on d15 d17)
(on s9 d15)
(clear s9)
)
(:goal
(and
(home c4)
(home h4)
(home s4)
(home d4)
)
)
)

; plan
1. (sendtofree h19 h1 celln48 celln47)
   deleted: (on h19 h1) (clear h19) (cellspace celln48)
   added: (incell h19) (clear h1) (cellspace celln47)
   goals met: 0 of 4
2. (sendtohome h1 s1 h n1 h0 n0)
   deleted: (on h1 s1) (home h0) (clear h1)
   added: (home h1) (clear s1)
   goals met: 0 of 4
3. (sendtohome-b s1 s n1 s0 n0 coln0 coln1)
   deleted: (home s0) (clear s1) (bottomcol s1) (colspace coln0)
   added: (home s1) (colspace coln1)
   goals met: 0 of 4
4. (sendtofree d24 h15 celln47 celln46)
   deleted: (on d24 h15) (clear d24) (cellspace celln47)
   added: (incell d24) (clear h15) (cellspace celln46)
   goals met: 0 of 4
5. (sendtofree d10 s2 celln46 celln45)
   deleted: (on d10 s2) (clear d10) (cellspace celln46)
   added: (incell d10) (clear s2) (cellspace celln45)
   goals met: 0 of 4
6. (sendtohome s2 s20 s n2 s1 n1)
   deleted: (on s2 s20) (home s1) (clear s2)
   added: (home s2) (clear s20)
   goals met: 0 of 4
7. (move s20 d1 h21)
   deleted: (on s20 d1) (clear h21)
   added: (on s20 h21) (clear d1)
   goals met: 0 of 4
8. (sendtohome d1 d8 d n1 d0 n0)
   deleted: (on d1 d8) (home d0) (clear d1)
   added: (home d1) (clear d8)
   goals met: 0 of 4
9. (move c2 h2 h3)
   deleted: (on c2 h2) (clear h3)
   added: (on c2 h3) (clear h2)
   goals met: 0 of 4
10. (sendtohome h2 d14 h n2 h1 n1)
   deleted: (on h2 d14) (home h1) (clear h2)
   added: (home h2) (clear d14)
   goals met: 0 of 4
11. (sendtofree c2 h3 celln45 celln44)
   deleted: (on c2 h3) (clear c2) (cellspace celln45)
   added: (incell c2) (clear h3) (cellspace celln44)
   goals met: 0 of 4
12. (sendtohome h3 c20 h n3 h2 n2)
   deleted: (on h3 c20) (home h2) (clear h3)
   added: (home h3) (clear c20)
   goals met: 0 of 4
13. (sendtohome h4 h22 h n4 h3 n3)
   deleted: (on h4 h22) (home h3) (clear h4)
   added: (home h4) (clear h22)
   goals met: 1 of 4
14. (move s18 d2 d19)
   deleted: (on s18 d2) (clear d19)
   added: (on s18 d19) (clear d2)
   goals met: 1 of 4
15. (sendtohome d2 d21 d n2 d1 n1)
   deleted: (on d2 d21) (home d1) (clear d2)
   added: (home d2) (clear d21)
   goals met: 1 of 4
16. (sendtofree h15 c3 celln44 celln43)
   deleted: (on h15 c3) (clear h15) (cellspace celln44)
   added: (incell h15) (clear c3) (cellspace celln43)
   goals met: 1 of 4
17. (sendtofree c3 c1 celln43 celln42)
   deleted: (on c3 c1) (clear c3) (cellspace celln43)
   added: (incell c3) (clear c1) (cellspace celln42)
   goals met: 1 of 4
18. (sendtohome-b c1 c n1 c0 n0 coln1 coln2)
   deleted: (home c0) (clear c1) (bottomcol c1) (colspace coln1)
   added: (home c1) (colspace coln2)
   goals met: 1 of 4
19. (homefromfreecell c2 c n2 c1 n1 celln42 celln43)
   deleted: (incell c2) (cellspace celln42) (home c1)
   added: (home c2) (cellspace celln43)
   goals met: 1 of 4
20. (homefromfreecell c3 c n3 c2 n2 celln43 celln44)
   deleted: (incell c3) (cellspace celln43) (home c2)
   added: (home c3) (cellspace celln44)
   goals met: 1 of 4
21. (sendtofree h11 d23 celln44 celln43)
   deleted: (on h11 d23) (clear h11) (cellspace celln44)
   added: (incell h11) (clear d23) (cellspace celln43)
   goals met: 1 of 4
22. (sendtofree d23 d16 celln43 celln42)
   deleted: (on d23 d16) (clear d23) (cellspace celln43)
   added: (incell d23) (clear d16) (cellspace celln42)
   goals met: 1 of 4
23. (sendtofree h22 c4 celln42 celln41)
   deleted: (on h22 c4) (clear h22) (cellspace celln42)
   added: (incell h22) (clear c4) (cellspace celln41)
   goals met: 1 of 4
24. (sendtohome c4 c16 c n4 c3 n3)
   deleted: (on c4 c16) (home c3) (clear c4)
   added: (home c4) (clear c16)
   goals met: 2 of 4
25. (sendtofree d20 h8 celln41 celln40)
   deleted: (on d20 h8) (clear d20) (cellspace celln41)
   added: (incell d20) (clear h8) (cellspace celln40)
   goals met: 2 of 4
26. (move h8 s3 c9)
   deleted: (on h8 s3) (clear c9)
   added: (on h8 c9) (clear s3)
   goals met: 2 of 4
27. (sendtohome s3 d18 s n3 s2 n2)
   deleted: (on s3 d18) (home s2) (clear s3)
   added: (home s3) (clear d18)
   goals met: 2 of 4
28. (sendtofree d16 c6 celln40 celln39)
   deleted: (on d16 c6) (clear d16) (cellspace celln40)
   added: (incell d16) (clear c6) (cellspace celln39)
   goals met: 2 of 4
29. (sendtofree d12 s6 celln39 celln38)
   deleted: (on d12 s6) (clear d12) (cellspace celln39)
   added: (incell d12) (clear s6) (cellspace celln38)
   goals met: 2 of 4
30. (move s6 s12 d7)
   deleted: (on s6 s12) (clear d7)
   added: (on s6 d7) (clear s12)
   goals met: 2 of 4
31. (sendtofree s12 s4 celln38 celln37)
   deleted: (on s12 s4) (clear s12) (cellspace celln38)
   added: (incell s12) (clear s4) (cellspace celln37)
   goals met: 2 of 4
32. (sendtohome s4 h24 s n4 s3 n3)
   deleted: (on s4 h24) (home s3) (clear s4)
   added: (home s4) (clear h24)
   goals met: 3 of 4
33. (sendtofree d9 h12 celln37 celln36)
   deleted: (on d9 h12) (clear d9) (cellspace celln37)
   added: (incell d9) (clear h12) (cellspace celln36)
   goals met: 3 of 4
34. (sendtofree h12 d11 celln36 celln35)
   deleted: (on h12 d11) (clear h12) (cellspace celln36)
   added: (incell h12) (clear d11) (cellspace celln35)
   goals met: 3 of 4
35. (sendtofree d11 c13 celln35 celln34)
   deleted: (on d11 c13) (clear d11) (cellspace celln35)
   added: (incell d11) (clear c13) (cellspace celln34)
   goals met: 3 of 4
36. (sendtofree c13 c14 celln34 celln33)
   deleted: (on c13 c14) (clear c13) (cellspace celln34)
   added: (incell c13) (clear c14) (cellspace celln33)
   goals met: 3 of 4
37. (sendtofree c14 c21 celln33 celln32)
   deleted: (on c14 c21) (clear c14) (cellspace celln33)
   added: (incell c14) (clear c21) (cellspace celln32)
   goals met: 3 of 4
38. (sendtofree c21 d4 celln32 celln31)
   deleted: (on c21 d4) (clear c21) (cellspace celln32)
   added: (incell c21) (clear d4) (cellspace celln31)
   goals met: 3 of 4
39. (sendtofree c6 h9 celln31 celln30)
   deleted: (on c6 h9) (clear c6) (cellspace celln31)
   added: (incell c6) (clear h9) (cellspace celln30)
   goals met: 3 of 4
40. (sendtofree h9 d3 celln30 celln29)
   deleted: (on h9 d3) (clear h9) (cellspace celln30)
   added: (incell h9) (clear d3) (cellspace celln29)
   goals met: 3 of 4
41. (sendtohome d3 h13 d n3 d2 n2)
   deleted: (on d3 h13) (home d2) (clear d3)
   added: (home d3) (clear h13)
   goals met: 3 of 4
42. (sendtohome d4 d6 d n4 d3 n3)
   deleted: (on d4 d6) (home d3) (clear d4)
   added: (home d4) (clear d6)
   goals met: 4 of 4
